In [1]:
import pandas as pd
import numpy as np

In [2]:
data_path = '../data/'
listing_info_fn = 'listing_info.csv'
test_fn = 'test.csv'
train_fn = 'train.csv'
user_behavior_logs_fn = 'user_behavior_logs.csv'
user_info_fn = 'user_info.csv'
user_repay_logs_fn  = 'user_repay_logs.csv'
user_taglist_fn = 'user_taglist.csv'

In [61]:
listing_info_data = pd.read_csv(data_path+listing_info_fn)

In [17]:
# listing_info_data = pd.read_csv(data_path+listing_info_fn)
test_data = pd.read_csv(data_path+test_fn)
train_data = pd.read_csv(data_path+train_fn)
# user_behavior_logs_data = pd.read_csv(data_path+user_behavior_logs_fn)
user_info_data = pd.read_csv(data_path+user_info_fn)
# user_repay_logs_data = pd.read_csv(data_path+user_repay_logs_fn)
user_taglist_data = pd.read_csv(data_path+user_taglist_fn)

In [63]:
print(listing_info_data.shape)
print(test_data.shape)
print(train_data.shape)
print(user_info_data.shape)
print(user_taglist_data.shape)

(5484891, 6)
(130000, 5)
(1000000, 7)
(954209, 8)
(615160, 3)

In [62]:
listing_info_data.head()

   user_id  listing_id auditing_date  term  rate  principal
0   316610     1556649    2017-11-26     9   7.6       4800
1    62002     1556633    2017-11-26     6   7.6       4000
2   192135     1556629    2017-11-26    12   8.0       8660
3   487382     1556628    2017-11-26     9   7.6       4780
4   235186     1556627    2017-11-26     9   7.6       1480

In [6]:
train_data.head()

,user_id,listing_id,auditing_date,due_date,due_amt,repay_date,repay_amt
0,748147,3163926,2018-04-25,2018-05-25,72.1167,2018-05-25,72.1167
1,672952,3698760,2018-06-09,2018-07-09,258.7045,2018-07-08,258.7045
2,404196,2355665,2018-02-18,2018-03-18,307.9270,\N,\N
3,342769,1994522,2018-01-13,2018-02-13,252.9809,2018-02-13,252.9809
4,828139,3602352,2018-06-01,2018-07-01,107.6503,2018-06-25,107.6503

In [7]:
test_data.head()

   user_id  listing_id auditing_date    due_date   due_amt
0   498765     5431438    2019-03-12  2019-04-12  138.5903
1    34524     5443211    2019-03-15  2019-04-15  208.0805
2   821741     5461707    2019-03-22  2019-04-22  421.2097
3   263534     5472320    2019-03-26  2019-04-26  212.6537
4   238853     5459750    2019-03-21  2019-04-21  817.4593

In [10]:
user_info_data.head()

   user_id  reg_mon gender  age cell_province id_province id_city  insertdate
0   483833  2017-04      男   19           c29         c26  c26241  2018-12-11
1   156772  2016-05      男   31           c11         c11  c11159  2018-02-13
2   173388  2016-05      男   34           c02         c02  c02182  2018-08-21
3   199107  2016-07      女   25           c09         c09  c09046  2018-06-05
4   122560  2016-03      男   23           c05         c05  c05193  2018-04-02

In [11]:
user_taglist_data.head()

   user_id                                            taglist  insertdate
0   113401  4707|473|3498|4759|1654|298|2869|1164|212|1885...  2018-10-03
1   378358  751|2207|1100|2099|1832|1911|5347|2254|171|360...  2018-11-30
2   434838  877|3795|5628|70|2684|691|719|4228|631|1541|12...  2018-03-25
3   577061  2431|3242|340|1823|4020|4357|164|620|2168|1192...  2018-05-25
4   566753  3980|3125|1819|1333|1177|3972|621|5800|3632|16...  2018-12-02

### 对user_id进行筛查

In [64]:
print(len(listing_info_data['user_id'].value_counts()))
print(len(train_data['user_id'].value_counts()))
# print(len(test_data['user_id'].value_counts()))
print(len(user_info_data['user_id'].value_counts()))
print(len(user_taglist_data['user_id'].value_counts()))

928195
823732
928195
535380

从上面的结果可以看出，资产标的和用户信息的userid数量是一致的

In [29]:
user_info_data[user_info_data['user_id'] == 567844]

,user_id,reg_mon,gender,age,cell_province,id_province,id_city,insertdate
229888,567844,2017-07,男,28,\N,c12,c12088,2019-02-19
231091,567844,2017-07,男,27,c21,c12,c12088,2018-03-28
231366,567844,2017-07,男,27,\N,c12,c12088,2018-11-17

In [76]:
print(len(listing_info_data['user_id'].value_counts()))
(listing_info_data['user_id'].value_counts()>1).head()

928195

712075    True
491698    True
35086     True
539106    True
531641    True
Name: user_id, dtype: bool

In [78]:
(listing_info_data[listing_info_data['user_id'] == 567844]).sort_values('auditing_date')

         user_id  listing_id auditing_date  term  rate  principal
4947098   567844      519772    2017-07-05     3   8.0      11060
4610759   567844      946691    2017-09-10     3   8.0       1170
4580888   567844      985981    2017-09-16     3   8.0        850
4564242   567844      999710    2017-09-19     3   8.0       3350
4491955   567844     1104931    2017-10-04     3   8.0       3350
4371233   567844     1240062    2017-10-21     3   7.6       1170
4139956   567844     1445939    2017-11-13     3   7.6       1170
4112453   567844     1556322    2017-11-25     6   7.6       1170
4777676   567844     2260723    2018-02-09     6   8.0       2260
4734303   567844     2317558    2018-02-14     6   8.0       5540
4395426   567844     2775039    2018-03-26     6   8.0        630
4371402   567844     2819123    2018-03-29     6   8.0       1170
5182875   567844     3514218    2018-05-24     6   8.6        740
4939060   567844     3779006    2018-06-19     6   8.0       1170
4779662   567844     3995296    2018-07-14    12   8.6       2260
5443917   567844     4665569    2018-10-16     3   7.2       3350
5310407   567844     4792320    2018-10-30     3   7.2       1170
5213152   567844     4882823    2018-11-09     6   7.6       3350
5178357   567844     4914848    2018-11-14     6   7.6       3350
5159654   567844     4936163    2018-11-18     6   7.2       7450
4309786   567844     5135284    2018-12-16     6   6.9       2710
4260507   567844     5230711    2019-01-11     6   6.9       3150
4227224   567844     5319812    2019-02-11     6   6.9       6590
4220814   567844     5345429    2019-02-17     6   6.5       2260
4220436   567844     5346851    2019-02-18     6   6.5       4390
4220288   567844     5347428    2019-02-18     6   6.5       2260
4217775   567844     5357497    2019-02-20     3   6.5       2260

In [ ]:
listing_info_data[listing_info_data['user_id'] == 567844]

In [65]:
train_userid_idx = train_data['user_id'].value_counts().index
user_info_userid_idx = user_info_data['user_id'].value_counts().index
user_taglist_userid_idx = user_taglist_data['user_id'].value_counts().index
listing_info_data_userid_idx = listing_info_data['user_id'].value_counts().index
# user_info_multiinsert_real = user_multiinsert_all.index[user_multiinsert == True]

In [57]:
train_user_info_idx = train_userid_idx.isin(user_info_userid_idx)
pd.Series(train_user_info_idx).value_counts()

True    823732
dtype: int64

In [58]:
user_info_train_idx = user_info_userid_idx.isin(train_userid_idx)
pd.Series(user_info_train_idx).value_counts()

True     823732
False    104463
dtype: int64

In [59]:
user_taglist_train_idx = user_taglist_userid_idx.isin(train_userid_idx)
pd.Series(user_taglist_train_idx).value_counts()

True     471468
False     63912
dtype: int64

In [60]:
user_taglist_user_info_idx = user_taglist_userid_idx.isin(user_info_userid_idx)
pd.Series(user_taglist_user_info_idx).value_counts()

True    535380
dtype: int64

In [67]:
listing_info_user_info_idx = listing_info_data_userid_idx.isin(user_info_data)
pd.Series(listing_info_user_info_idx).value_counts()

False    928195
dtype: int64